title: Win Application Msmpeng Crash Error
id: e5607287-a0d5-474e-9863-8d7cca24427b
status: experimental
description: Detects the use of aukill to evade EDR detection.
references:
    - 
author: Samuel
date: 2024/08/10
tags:
    - attack.t1562
logsource:
    category: antivirus
    product: aws
    service: activitylogs
detection:
    selection:
        targetfile | .sys
        targetfile | \\system32\\
    condition: selection
falsepositives:
    - Unknown
level: critical


