title: Proxy Download Susp Dyndns
id: 7a296409-7fba-4fa9-a3c1-e85c8d5dbf7e
status: experimental
description: Detects 
references:
    - 
author: Samuel
date: 2024/08/10
tags:
    - 
logsource:
    category: antivirus
    product: aws
    service: activitylogs
detection:
    selection:
        
    condition: selection
falsepositives:
    - Unknown
level: critical
